package com.shpp.p2p.cs.dbelinskyi.assignment1;

import com.shpp.p2p.cs.dbelinskyi.SuperKarel;

public class Assignment1Part3 extends SuperKarel {
    /**
     * Задача 3 - Шахова дошка
     * ПРЯМОКУТНИК - ЦЕ НЕ ТІЛЬКИ КВАДРАТ
     * Один з поставлених біперів має знаходитись в південно-західному куті карти
     * Карел стартує з південно-західного кута, дивиться на схід
     * Довжина або ширина може бути 1
     * Не обов'язково вигадувати якусь круту оптимізацію
     * Основна задача - це розмістити біпери так, як
     * розташовані чорні клітинки на шахівниці
     */
    public void run() throws Exception {
         //Спочатку робимо непарні лінії, тобто ті, де на початку має лежати біпер
         //Після цього переходимо до початку парних ліній, тих де на початку не має бути біперу.
        makeOddRows();
        goToStartOfEvenRows();
        //leftIsClear() на випадок одного рядку
        //noBeepersPresent() на випадок двух
        if (leftIsClear() || noBeepersPresent()) {
            makeEvenRows();
        }
    }

    /**
     * Передумова: Карел стоїть на початку першої непарної лінії, дивиться на схід
     * Результат: Всі непарні лінії побудовано, Карел стоїть в північно-східному куті, дивиться на північ
     */
    private void makeOddRows() throws Exception {
        //Робимо рядок, повертаємось дивлячись на північ
        //Якщо стіни немає, йдемо вперед
        //Ще раз перевіряємо чи немає стіни, як ні - йдемо вперед, повертаємо направо
        // і запускаємо цю функцію знову
        makeRow();
        goBack();
        carefulStepForward();
        if (frontIsClear()) {
            move();
            turnRight();
            makeOddRows();
        }
    }


    /**
     * Передумови: Карел стоїть на початку рядка, де починаються біпери. Дивиться на схід.
     * Результат: Рядок закінчений, Карел стоїть в кінці рядка, дивлячись на схід.
     */
    private void makeRow() throws Exception {
        //Цей метод використовується тільки коли Карел стоїть на місці, де має бути біпер
        //Кладемо біпер, з перевіркою стіни попереду йдемо вперед
        //Знову перевіряємо стіну, якщо немає, то запускаємо цю функцію знову
        putBeeper();
        carefulStepForward();
        if (frontIsClear()) {
            move();
            makeRow();
        }
    }

    /**
     * Передумови: Карел стоїть в кінці останнього непарного, дивиться на схід
     * Результат: Карел стоїть на початку першого парного, дивиться на схід
     */
    private void goToStartOfEvenRows() throws Exception {
        //Тут просто після того, як зробили непарні лінії, йдемо до початку парних
        //і повертаємось направо.
        //Також важливо використовувати обережний рух, на випадок, якщо на карті лише один рядок
        turnAround();
        moveToTheWall();
        turnAround();
        carefulStepForward();
        turnRight();
    }

    /**
     * Передумови: Карел стоїть на початку першого парного рядка, тобто на другому, дивиться на схід.
     * Результат: Всі парні рядки закінчені, Карел стоїть в кінці останнього, дивлячись на схід.
     */
    private void makeEvenRows() throws Exception {
        //Тут майже те ж саме, що з функцією makeOddRows. Але відмінність в тому, що
        //ми вже не можемо просто використовувати makeRow(). Тут кожного разу ще потрібно
        //відступати вперед, це вже інший метод тут використовується, тому й цей метод інший
        makeEvenRow();
        goBack();
        carefulStepForward();
        if (frontIsClear()) {
            move();
            turnRight();
            makeEvenRows();
        }
    }

    /**
     * Передумова: Карел стоїть на початку парного рядка, тобто в першій клітинці не має бути біперів. Дивиться на схід
     * Результат: Карел стоїть на кінці парного рядка, дивиться на схід
     */
    private void makeEvenRow() throws Exception {
        //Те ж саме, що й makeRow, але з рухом вперед
        if (frontIsClear()) {
            move();
            makeRow();
        }
    }

    /**
     * Передумови: Карел стоїть в кінці закінченого рядка (будь якого), дивиться на схід.
     * Результат: Карел повернувся в початок ряду, дивиться на північ
     */
    private void goBack() throws Exception {
        turnAround();
        moveToTheWall();
        turnRight();
    }

    /**
     * Передумови: Карел стоїть на початку закінченого ряду. Дивиться на північ
     * Результат: Карел пройшов два кроки вперед, перевіряючи, чи немає стіни попереду. Дивиться на північ.
     */
    private void carefulStepForward() throws Exception {
        if (frontIsClear()) {
            move();
        }
    }
}
